#### 📖 Terraform Plan ('infra/resources/prod') - success
<details>
<summary>Terraform Plan</summary>

```hcl
data.azurerm_linux_function_app.function_public_old: Still reading... [10s elapsed]
data.azurerm_linux_function_app.function_public_old: Still reading... [20s elapsed]
module.function_lollipop_autoscale.data.azurerm_linux_function_app.this[0]: Still reading... [10s elapsed]
module.function_lv_autoscale.data.azurerm_linux_function_app.this[0]: Still reading... [10s elapsed]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.io_profile_apim_api_itn.azurerm_api_management_api_operation_policy.get_profile_operation will be created
  + resource "azurerm_api_management_api_operation_policy" "get_profile_operation" {
      + api_management_name = "io-p-itn-apim-01"
      + api_name            = "io-profile-operation-api"
      + id                  = (known after apply)
      + operation_id        = "getProfile"
      + resource_group_name = "io-p-itn-common-rg-01"
      + xml_content         = <<-EOT
            <policies>
                <inbound>
                    <base />
                    <choose>
                        <when condition="@(!context.User.Groups.Select(g => g.Name).Contains("{{api-profile-operation-group-name}}"))">
                            <return-response>
                                <set-status code="403" reason="Unauthorized, the subscription used doesn't have the required permission" />
                            </return-response>
                        </when>
                    </choose>
                </inbound>
                <backend>
                    <base />
                </backend>
                <outbound>
                    <base />
                </outbound>
                <on-error>
                    <base />
                </on-error>
            </policies>
        EOT
    }

  # module.io_profile_apim_api_itn.azurerm_api_management_group.api_profile_operation_read will be created
  + resource "azurerm_api_management_group" "api_profile_operation_read" {
      + api_management_name = "io-p-itn-apim-01"
      + id                  = (known after apply)
      + name                = "apiprofileoperationread"
      + resource_group_name = "io-p-itn-common-rg-01"
      + type                = "custom"
    }

  # module.io_profile_apim_api_itn.azurerm_api_management_named_value.api_profile_operation_group_name will be created
  + resource "azurerm_api_management_named_value" "api_profile_operation_group_name" {
      + api_management_name = "io-p-itn-apim-01"
      + display_name        = "api-profile-operation-group-name"
      + id                  = (known after apply)
      + name                = "api-profile-operation-group-name"
      + resource_group_name = "io-p-itn-common-rg-01"
      + secret              = true
      + value               = (sensitive value)
    }

  # module.io_profile_apim_api_itn.azurerm_api_management_named_value.io_fn_profile_key will be created
  + resource "azurerm_api_management_named_value" "io_fn_profile_key" {
      + api_management_name = "io-p-itn-apim-01"
      + display_name        = "io-fn-profile-key"
      + id                  = (known after apply)
      + name                = "io-fn-profile-key"
      + resource_group_name = "io-p-itn-common-rg-01"
      + secret              = true
      + value               = (sensitive value)
    }

  # module.io_profile_apim_api_itn.azurerm_api_management_named_value.io_fn_profile_url will be created
  + resource "azurerm_api_management_named_value" "io_fn_profile_url" {
      + api_management_name = "io-p-itn-apim-01"
      + display_name        = "io-fn-profile-url"
      + id                  = (known after apply)
      + name                = "io-fn-profile-url"
      + resource_group_name = "io-p-itn-common-rg-01"
      + secret              = false
      + value               = (sensitive value)
    }

  # module.io_profile_apim_api_weu.azurerm_api_management_api_operation_policy.get_profile_operation will be created
  + resource "azurerm_api_management_api_operation_policy" "get_profile_operation" {
      + api_management_name = "io-p-apim-v2-api"
      + api_name            = "io-profile-operation-api"
      + id                  = (known after apply)
      + operation_id        = "getProfile"
      + resource_group_name = "io-p-rg-internal"
      + xml_content         = <<-EOT
            <policies>
                <inbound>
                    <base />
                    <choose>
                        <when condition="@(!context.User.Groups.Select(g => g.Name).Contains("{{api-profile-operation-group-name}}"))">
                            <return-response>
                                <set-status code="403" reason="Unauthorized, the subscription used doesn't have the required permission" />
                            </return-response>
                        </when>
                    </choose>
                </inbound>
                <backend>
                    <base />
                </backend>
                <outbound>
                    <base />
                </outbound>
                <on-error>
                    <base />
                </on-error>
            </policies>
        EOT
    }

  # module.io_profile_apim_api_weu.azurerm_api_management_group.api_profile_operation_read will be created
  + resource "azurerm_api_management_group" "api_profile_operation_read" {
      + api_management_name = "io-p-apim-v2-api"
      + id                  = (known after apply)
      + name                = "apiprofileoperationread"
      + resource_group_name = "io-p-rg-internal"
      + type                = "custom"
    }

  # module.io_profile_apim_api_weu.azurerm_api_management_named_value.api_profile_operation_group_name will be created
  + resource "azurerm_api_management_named_value" "api_profile_operation_group_name" {
      + api_management_name = "io-p-apim-v2-api"
      + display_name        = "api-profile-operation-group-name"
      + id                  = (known after apply)
      + name                = "api-profile-operation-group-name"
      + resource_group_name = "io-p-rg-internal"
      + secret              = true
      + value               = (sensitive value)
    }

  # module.io_profile_apim_api_weu.azurerm_api_management_named_value.io_fn_profile_key will be created
  + resource "azurerm_api_management_named_value" "io_fn_profile_key" {
      + api_management_name = "io-p-apim-v2-api"
      + display_name        = "io-fn-profile-key"
      + id                  = (known after apply)
      + name                = "io-fn-profile-key"
      + resource_group_name = "io-p-rg-internal"
      + secret              = true
      + value               = (sensitive value)
    }

  # module.io_profile_apim_api_weu.azurerm_api_management_named_value.io_fn_profile_url will be created
  + resource "azurerm_api_management_named_value" "io_fn_profile_url" {
      + api_management_name = "io-p-apim-v2-api"
      + display_name        = "io-fn-profile-url"
      + id                  = (known after apply)
      + name                = "io-fn-profile-url"
      + resource_group_name = "io-p-rg-internal"
      + secret              = false
      + value               = (sensitive value)
    }

  # module.io_profile_apim_api_itn.module.api_v2_profile_operation.azurerm_api_management_api.this will be created
  + resource "azurerm_api_management_api" "this" {
      + api_management_name   = "io-p-itn-apim-01"
      + api_type              = "http"
      + description           = "Product for IO Profile Operation."
      + display_name          = "IO PROFILE OPERATION API"
      + id                    = (known after apply)
      + is_current            = (known after apply)
      + is_online             = (known after apply)
      + name                  = "io-profile-operation-api"
      + path                  = "profile/api/v1"
      + protocols             = [
          + "https",
        ]
      + resource_group_name   = "io-p-itn-common-rg-01"
      + revision              = "1"
      + service_url           = (known after apply)
      + soap_pass_through     = (known after apply)
      + subscription_required = false
      + version               = (known after apply)
      + version_set_id        = (known after apply)

      + import {
          + content_format = "openapi"
          + content_value  = <<-EOT
                openapi: 3.0.1
                info:
                  version: 5.19.0
                  title: IO Profile Function API
                  x-logo:
                    url: https://io.italia.it/assets/img/io-logo-blue.svg
                  description: |
                    Documentation of the IO Profile Function API here.
                servers:
                  - url: https://api.io.pagopa.it/profile/api/v1
                security:
                  - ApiKeyAuth: []
                paths:
                  /profiles/{fiscal_code}:
                    get:
                      operationId: getProfile
                      summary: GetProfile
                      description: Retrieve a user profile
                      tags:
                        - restricted
                      parameters:
                        - $ref: "#/components/parameters/FiscalCode"
                      responses:
                        "200":
                          description: Profile created
                          content:
                            application/json:
                              schema:
                                $ref: "#/components/schemas/ExtendedProfile"
                        "400":
                          description: Invalid request.
                          content:
                            application/json:
                              schema:
                                $ref: "#/components/schemas/ProblemJson"
                        "401":
                          description: Unauthorized
                        "403":
                          description: Forbidden
                        "404":
                          description: No message found.
                          content:
                            application/json:
                              schema:
                                $ref: "#/components/schemas/ProblemJson"
                        "429":
                          description: Too many requests
                        "500":
                          description: Server Error
                          content:
                            application/json:
                              schema:
                                $ref: "#/components/schemas/ProblemJson"
                components:
                  securitySchemes:
                    ApiKeyAuth:
                      type: apiKey
                      in: header
                      name: Ocp-Apim-Subscription-Key
                  parameters:
                    FiscalCode:
                      name: fiscal_code
                      in: path
                      type: string
                      maxLength: 16
                      minLength: 16
                      required: true
                      description: The fiscal code of the user, all upper case.
                      pattern: >-
                        [A-Z]{6}[0-9LMNPQRSTUV]{2}[ABCDEHLMPRST][0-9LMNPQRSTUV]{2}[A-Z][0-9LMNPQRSTUV]{3}[A-Z]
                      x-example: SPNDNL80R13C555X
                  schemas:
                    ExtendedProfile:
                      description: |-
                        Describes the citizen's profile, mostly interesting for preferences
                        attributes.
                      type: object
                      properties:
                        email:
                          $ref: "#/components/schemas/EmailAddress"
                        service_preferences_settings:
                          $ref: "#/components/schemas/ServicePreferencesSettings"
                        blocked_inbox_or_channels:
                          $ref: "#/components/schemas/BlockedInboxOrChannels"
                        preferred_languages:
                          $ref: "#/components/schemas/PreferredLanguages"
                        is_inbox_enabled:
                          $ref: "#/components/schemas/IsInboxEnabled"
                        accepted_tos_version:
                          $ref: "#/components/schemas/AcceptedTosVersion"
                        is_webhook_enabled:
                          $ref: "#/components/schemas/IsWebhookEnabled"
                        is_email_enabled:
                          $ref: "#/components/schemas/IsEmailEnabled"
                        is_email_validated:
                          $ref: "#/components/schemas/IsEmailValidated"
                        is_email_already_taken:
                          type: boolean
                          default: false
                          description: |-
                            True if the user email has been validated by another user.
                            If so, the user must provide a new email.
                        reminder_status:
                          $ref: "#/components/schemas/ReminderStatus"
                        is_test_profile:
                          $ref: "#/components/schemas/IsTestProfile"
                        last_app_version:
                          $ref: "#/components/schemas/AppVersion"
                        push_notifications_content_type:
                          $ref: "#/components/schemas/PushNotificationsContentType"
                        version:
                          type: integer
                      required:
                        - is_email_enabled
                        - is_email_validated
                        - is_email_already_taken
                        - is_inbox_enabled
                        - is_webhook_enabled
                        - service_preferences_settings
                        - version
                    EmailAddress:
                      type: string
                      format: email
                      example: foobar@example.com
                    ServicePreferencesSettings:
                      description: |-
                        Describes the citizen's profile, mostly interesting for preferences
                        attributes.
                      type: object
                      properties:
                        mode:
                          $ref: "#/components/schemas/ServicesPreferencesMode"
                      required:
                        - mode
                    ServicesPreferencesMode:
                      type: string
                      enum:
                        - LEGACY
                        - AUTO
                        - MANUAL
                    BlockedInboxOrChannel:
                      type: string
                      description: |-
                        All notification channels plus the message inbox.
                        These represent all the possible channels a user could block.
                      x-extensible-enum:
                        - EMAIL
                        - INBOX
                        - WEBHOOK
                      example: INBOX
                    BlockedInboxOrChannels:
                      type: object
                      additionalProperties:
                        type: array
                        items:
                          $ref: "#/components/schemas/BlockedInboxOrChannel"
                      description: |-
                        All the notification channels blocked by the user.
                        Each channel is related to a specific service (sender).
                    PreferredLanguages:
                      type: array
                      items:
                        $ref: "#/components/schemas/PreferredLanguage"
                      description: >-
                        Indicates the User's preferred written or spoken languages in order
                
                        of preference. Generally used for selecting a localized User interface.
                        Valid
                
                        values are concatenation of the ISO 639-1 two letter language code, an
                        underscore,
                
                        and the ISO 3166-1 2 letter country code; e.g., 'en_US' specifies the
                        language
                
                        English and country US.
                    PreferredLanguage:
                      type: string
                      x-extensible-enum:
                        - it_IT
                        - en_GB
                        - es_ES
                        - de_DE
                        - fr_FR
                      example: it_IT
                    IsInboxEnabled:
                      type: boolean
                      description: |-
                        True if the recipient of a message wants to store its content for
                        later retrieval.
                    AcceptedTosVersion:
                      type: number
                      minimum: 1
                      description: Version of latest terms of service accepted by the user.
                    IsWebhookEnabled:
                      type: boolean
                      description: >-
                        True if the recipient of a message wants to forward the notifications to
                        the default webhook.
                    IsEmailValidated:
                      type: boolean
                      description: True if the user email has been validated.
                    IsEmailEnabled:
                      type: boolean
                      description: >-
                        True if the recipient of a message wants to forward the notifications to
                        his email address.
                    ReminderStatus:
                      type: string
                      x-extensible-enum:
                        - ENABLED
                        - DISABLED
                      example: ENABLED
                      description: Api definition of reminder opt-in status
                    IsTestProfile:
                      type: boolean
                      description: True if the user's profile is only for test purpose.
                      default: false
                    AppVersion:
                      type: string
                      pattern: ^((0|[1-9]\\d*)\\.){2}(0|[1-9]\\d*)(\\.(0|[1-9]\\d*)){0,1}$
                      description: A string field in Semantic Versioning format
                      example: 1.10.11
                    PushNotificationsContentType:
                      type: string
                      x-extensible-enum:
                        - FULL
                        - ANONYMOUS
                      example: FULL
                      description: >-
                        This parameter specifies how a specific user wants to visualize push
                        notifications.
                
                        FULL leads to descriptive push notifications while ANONYMOUS leads to
                        silent ones.
                    ProblemJson:
                      type: object
                      properties:
                        type:
                          type: string
                          format: uri
                          description: |-
                            An absolute URI that identifies the problem type. When dereferenced,
                            it SHOULD provide human-readable documentation for the problem type
                            (e.g., using HTML).
                          default: about:blank
                          example: https://example.com/problem/constraint-violation
                        title:
                          type: string
                          description: |-
                            A short, summary of the problem type. Written in english and readable
                            for engineers (usually not suited for non technical stakeholders and
                            not localized); example: Service Unavailable
                        status:
                          type: integer
                          format: int32
                          description: >-
                            The HTTP status code generated by the origin server for this
                            occurrence
                
                            of the problem.
                          minimum: 100
                          maximum: 600
                          exclusiveMaximum: true
                          example: 200
                        detail:
                          type: string
                          description: |-
                            A human readable explanation specific to this occurrence of the
                            problem.
                          example: There was an error processing the request
                        instance:
                          type: string
                          format: uri
                          description: >-
                            An absolute URI that identifies the specific occurrence of the
                            problem.
                
                            It may or may not yield further information if dereferenced.
            EOT
        }
    }

  # module.io_profile_apim_api_itn.module.api_v2_profile_operation.azurerm_api_management_api_policy.this[0] will be created
  + resource "azurerm_api_management_api_policy" "this" {
      + api_management_name = "io-p-itn-apim-01"
      + api_name            = "io-profile-operation-api"
      + id                  = (known after apply)
      + resource_group_name = "io-p-itn-common-rg-01"
      + xml_content         = <<-EOT
            <policies>
                <inbound>
                    <base />
                    <set-backend-service base-url="{{io-fn-profile-url}}" />
                    <set-header name="x-functions-key" exists-action="override">
                        <value>{{io-fn-profile-key}}</value>
                    </set-header>
                </inbound>
                <outbound>
                    <base />
                </outbound>
            </policies>
        EOT
    }

  # module.io_profile_apim_api_itn.module.api_v2_profile_operation.azurerm_api_management_product_api.this["io-auth-n-identity-operation-api"] will be created
  + resource "azurerm_api_management_product_api" "this" {
      + api_management_name = "io-p-itn-apim-01"
      + api_name            = "io-profile-operation-api"
      + id                  = (known after apply)
      + product_id          = "io-auth-n-identity-operation-api"
      + resource_group_name = "io-p-itn-common-rg-01"
    }

  # module.io_profile_apim_api_itn.module.apim_v2_product_auth-n-identity_operation.azurerm_api_management_product.this will be created
  + resource "azurerm_api_management_product" "this" {
      + api_management_name   = "io-p-itn-apim-01"
      + approval_required     = false
      + description           = "Product for IO Auth And Identity Domani Operation APIs."
      + display_name          = "IO AUTH AND IDENTITY OPERATION API"
      + id                    = (known after apply)
      + product_id            = "io-auth-n-identity-operation-api"
      + published             = true
      + resource_group_name   = "io-p-itn-common-rg-01"
      + subscription_required = false
    }

  # module.io_profile_apim_api_itn.module.apim_v2_product_auth-n-identity_operation.azurerm_api_management_product_policy.this[0] will be created
  + resource "azurerm_api_management_product_policy" "this" {
      + api_management_name = "io-p-itn-apim-01"
      + id                  = (known after apply)
      + product_id          = "io-auth-n-identity-operation-api"
      + resource_group_name = "io-p-itn-common-rg-01"
      + xml_content         = <<-EOT
            <policies>
                <inbound>
                    <base />
                </inbound>
                <backend>
                    <base />
                </backend>
                <outbound>
                    <base />
                </outbound>
                <on-error>
                    <base />
                </on-error>
            </policies>
        EOT
    }

  # module.io_profile_apim_api_weu.module.api_v2_profile_operation.azurerm_api_management_api.this will be created
  + resource "azurerm_api_management_api" "this" {
      + api_management_name   = "io-p-apim-v2-api"
      + api_type              = "http"
      + description           = "Product for IO Profile Operation."
      + display_name          = "IO PROFILE OPERATION API"
      + id                    = (known after apply)
      + is_current            = (known after apply)
      + is_online             = (known after apply)
      + name                  = "io-profile-operation-api"
      + path                  = "profile/api/v1"
      + protocols             = [
          + "https",
        ]
      + resource_group_name   = "io-p-rg-internal"
      + revision              = "1"
      + service_url           = (known after apply)
      + soap_pass_through     = (known after apply)
      + subscription_required = false
      + version               = (known after apply)
      + version_set_id        = (known after apply)

      + import {
          + content_format = "openapi"
          + content_value  = <<-EOT
                openapi: 3.0.1
                info:
                  version: 5.19.0
                  title: IO Profile Function API
                  x-logo:
                    url: https://io.italia.it/assets/img/io-logo-blue.svg
                  description: |
                    Documentation of the IO Profile Function API here.
                servers:
                  - url: https://api.io.pagopa.it/profile/api/v1
                security:
                  - ApiKeyAuth: []
                paths:
                  /profiles/{fiscal_code}:
                    get:
                      operationId: getProfile
                      summary: GetProfile
                      description: Retrieve a user profile
                      tags:
                        - restricted
                      parameters:
                        - $ref: "#/components/parameters/FiscalCode"
                      responses:
                        "200":
                          description: Profile created
                          content:
                            application/json:
                              schema:
                                $ref: "#/components/schemas/ExtendedProfile"
                        "400":
                          description: Invalid request.
                          content:
                            application/json:
                              schema:
                                $ref: "#/components/schemas/ProblemJson"
                        "401":
                          description: Unauthorized
                        "403":
                          description: Forbidden
                        "404":
                          description: No message found.
                          content:
                            application/json:
                              schema:
                                $ref: "#/components/schemas/ProblemJson"
                        "429":
                          description: Too many requests
                        "500":
                          description: Server Error
                          content:
                            application/json:
                              schema:
                                $ref: "#/components/schemas/ProblemJson"
                components:
                  securitySchemes:
                    ApiKeyAuth:
                      type: apiKey
                      in: header
                      name: Ocp-Apim-Subscription-Key
                  parameters:
                    FiscalCode:
                      name: fiscal_code
                      in: path
                      type: string
                      maxLength: 16
                      minLength: 16
                      required: true
                      description: The fiscal code of the user, all upper case.
                      pattern: >-
                        [A-Z]{6}[0-9LMNPQRSTUV]{2}[ABCDEHLMPRST][0-9LMNPQRSTUV]{2}[A-Z][0-9LMNPQRSTUV]{3}[A-Z]
                      x-example: SPNDNL80R13C555X
                  schemas:
                    ExtendedProfile:
                      description: |-
                        Describes the citizen's profile, mostly interesting for preferences
                        attributes.
                      type: object
                      properties:
                        email:
                          $ref: "#/components/schemas/EmailAddress"
                        service_preferences_settings:
                          $ref: "#/components/schemas/ServicePreferencesSettings"
                        blocked_inbox_or_channels:
                          $ref: "#/components/schemas/BlockedInboxOrChannels"
                        preferred_languages:
                          $ref: "#/components/schemas/PreferredLanguages"
                        is_inbox_enabled:
                          $ref: "#/components/schemas/IsInboxEnabled"
                        accepted_tos_version:
                          $ref: "#/components/schemas/AcceptedTosVersion"
                        is_webhook_enabled:
                          $ref: "#/components/schemas/IsWebhookEnabled"
                        is_email_enabled:
                          $ref: "#/components/schemas/IsEmailEnabled"
                        is_email_validated:
                          $ref: "#/components/schemas/IsEmailValidated"
                        is_email_already_taken:
                          type: boolean
                          default: false
                          description: |-
                            True if the user email has been validated by another user.
                            If so, the user must provide a new email.
                        reminder_status:
                          $ref: "#/components/schemas/ReminderStatus"
                        is_test_profile:
                          $ref: "#/components/schemas/IsTestProfile"
                        last_app_version:
                          $ref: "#/components/schemas/AppVersion"
                        push_notifications_content_type:
                          $ref: "#/components/schemas/PushNotificationsContentType"
                        version:
                          type: integer
                      required:
                        - is_email_enabled
                        - is_email_validated
                        - is_email_already_taken
                        - is_inbox_enabled
                        - is_webhook_enabled
                        - service_preferences_settings
                        - version
                    EmailAddress:
                      type: string
                      format: email
                      example: foobar@example.com
                    ServicePreferencesSettings:
                      description: |-
                        Describes the citizen's profile, mostly interesting for preferences
                        attributes.
                      type: object
                      properties:
                        mode:
                          $ref: "#/components/schemas/ServicesPreferencesMode"
                      required:
                        - mode
                    ServicesPreferencesMode:
                      type: string
                      enum:
                        - LEGACY
                        - AUTO
                        - MANUAL
                    BlockedInboxOrChannel:
                      type: string
                      description: |-
                        All notification channels plus the message inbox.
                        These represent all the possible channels a user could block.
                      x-extensible-enum:
                        - EMAIL
                        - INBOX
                        - WEBHOOK
                      example: INBOX
                    BlockedInboxOrChannels:
                      type: object
                      additionalProperties:
                        type: array
                        items:
                          $ref: "#/components/schemas/BlockedInboxOrChannel"
                      description: |-
                        All the notification channels blocked by the user.
                        Each channel is related to a specific service (sender).
                    PreferredLanguages:
                      type: array
                      items:
                        $ref: "#/components/schemas/PreferredLanguage"
                      description: >-
                        Indicates the User's preferred written or spoken languages in order
                
                        of preference. Generally used for selecting a localized User interface.
                        Valid
                
                        values are concatenation of the ISO 639-1 two letter language code, an
                        underscore,
                
                        and the ISO 3166-1 2 letter country code; e.g., 'en_US' specifies the
                        language
                
                        English and country US.
                    PreferredLanguage:
                      type: string
                      x-extensible-enum:
                        - it_IT
                        - en_GB
                        - es_ES
                        - de_DE
                        - fr_FR
                      example: it_IT
                    IsInboxEnabled:
                      type: boolean
                      description: |-
                        True if the recipient of a message wants to store its content for
                        later retrieval.
                    AcceptedTosVersion:
                      type: number
                      minimum: 1
                      description: Version of latest terms of service accepted by the user.
                    IsWebhookEnabled:
                      type: boolean
                      description: >-
                        True if the recipient of a message wants to forward the notifications to
                        the default webhook.
                    IsEmailValidated:
                      type: boolean
                      description: True if the user email has been validated.
                    IsEmailEnabled:
                      type: boolean
                      description: >-
                        True if the recipient of a message wants to forward the notifications to
                        his email address.
                    ReminderStatus:
                      type: string
                      x-extensible-enum:
                        - ENABLED
                        - DISABLED
                      example: ENABLED
                      description: Api definition of reminder opt-in status
                    IsTestProfile:
                      type: boolean
                      description: True if the user's profile is only for test purpose.
                      default: false
                    AppVersion:
                      type: string
                      pattern: ^((0|[1-9]\\d*)\\.){2}(0|[1-9]\\d*)(\\.(0|[1-9]\\d*)){0,1}$
                      description: A string field in Semantic Versioning format
                      example: 1.10.11
                    PushNotificationsContentType:
                      type: string
                      x-extensible-enum:
                        - FULL
                        - ANONYMOUS
                      example: FULL
                      description: >-
                        This parameter specifies how a specific user wants to visualize push
                        notifications.
                
                        FULL leads to descriptive push notifications while ANONYMOUS leads to
                        silent ones.
                    ProblemJson:
                      type: object
                      properties:
                        type:
                          type: string
                          format: uri
                          description: |-
                            An absolute URI that identifies the problem type. When dereferenced,
                            it SHOULD provide human-readable documentation for the problem type
                            (e.g., using HTML).
                          default: about:blank
                          example: https://example.com/problem/constraint-violation
                        title:
                          type: string
                          description: |-
                            A short, summary of the problem type. Written in english and readable
                            for engineers (usually not suited for non technical stakeholders and
                            not localized); example: Service Unavailable
                        status:
                          type: integer
                          format: int32
                          description: >-
                            The HTTP status code generated by the origin server for this
                            occurrence
                
                            of the problem.
                          minimum: 100
                          maximum: 600
                          exclusiveMaximum: true
                          example: 200
                        detail:
                          type: string
                          description: |-
                            A human readable explanation specific to this occurrence of the
                            problem.
                          example: There was an error processing the request
                        instance:
                          type: string
                          format: uri
                          description: >-
                            An absolute URI that identifies the specific occurrence of the
                            problem.
                
                            It may or may not yield further information if dereferenced.
            EOT
        }
    }

  # module.io_profile_apim_api_weu.module.api_v2_profile_operation.azurerm_api_management_api_policy.this[0] will be created
  + resource "azurerm_api_management_api_policy" "this" {
      + api_management_name = "io-p-apim-v2-api"
      + api_name            = "io-profile-operation-api"
      + id                  = (known after apply)
      + resource_group_name = "io-p-rg-internal"
      + xml_content         = <<-EOT
            <policies>
                <inbound>
                    <base />
                    <set-backend-service base-url="{{io-fn-profile-url}}" />
                    <set-header name="x-functions-key" exists-action="override">
                        <value>{{io-fn-profile-key}}</value>
                    </set-header>
                </inbound>
                <outbound>
                    <base />
                </outbound>
            </policies>
        EOT
    }

  # module.io_profile_apim_api_weu.module.api_v2_profile_operation.azurerm_api_management_product_api.this["io-auth-n-identity-operation-api"] will be created
  + resource "azurerm_api_management_product_api" "this" {
      + api_management_name = "io-p-apim-v2-api"
      + api_name            = "io-profile-operation-api"
      + id                  = (known after apply)
      + product_id          = "io-auth-n-identity-operation-api"
      + resource_group_name = "io-p-rg-internal"
    }

  # module.io_profile_apim_api_weu.module.apim_v2_product_auth-n-identity_operation.azurerm_api_management_product.this will be created
  + resource "azurerm_api_management_product" "this" {
      + api_management_name   = "io-p-apim-v2-api"
      + approval_required     = false
      + description           = "Product for IO Auth And Identity Domani Operation APIs."
      + display_name          = "IO AUTH AND IDENTITY OPERATION API"
      + id                    = (known after apply)
      + product_id            = "io-auth-n-identity-operation-api"
      + published             = true
      + resource_group_name   = "io-p-rg-internal"
      + subscription_required = false
    }

  # module.io_profile_apim_api_weu.module.apim_v2_product_auth-n-identity_operation.azurerm_api_management_product_policy.this[0] will be created
  + resource "azurerm_api_management_product_policy" "this" {
      + api_management_name = "io-p-apim-v2-api"
      + id                  = (known after apply)
      + product_id          = "io-auth-n-identity-operation-api"
      + resource_group_name = "io-p-rg-internal"
      + xml_content         = <<-EOT
            <policies>
                <inbound>
                    <base />
                </inbound>
                <backend>
                    <base />
                </backend>
                <outbound>
                    <base />
                </outbound>
                <on-error>
                    <base />
                </on-error>
            </policies>
        EOT
    }

Plan: 20 to add, 0 to change, 0 to destroy.

Warning: Deprecated Resource

  with data.azurerm_app_service_plan.shared_plan_itn,
  on data.tf line 35, in data "azurerm_app_service_plan" "shared_plan_itn":
  35: data "azurerm_app_service_plan" "shared_plan_itn" {

The `azurerm_app_service_plan` data source has been superseded by the
`azurerm_service_plan` data source. Whilst this resource will continue to be
available in the 2.x and 3.x releases it is feature-frozen for compatibility
purposes, will no longer receive any updates and will be removed in a future
major release of the Azure Provider.

(and 5 more similar warnings elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>
